jack77er/openUTRUSTA/Packages/.cache/Keil.EFM32ZGxxx_DFP.1.1.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>EFM32ZGxxx_DFP</name>
  <description>Silicon Labs EFM32 Zero Gecko Series Device Support, Drivers and Examples</description>

  <releases>
    <release version="1.1.0" date="2015-07-31">
      Updated device support files to V4.0.0.
      Added emlib support.
      Reworked EFM32ZG_STK3200 Blinky example.
      Changed Device Vendor to "Silicon Labs:21".
    </release>
    <release version="1.0.1" date="2014-02-20">
      Device description updated with features and flash programming algorithms
    </release>
    <release version="1.0.0">
      First Release version of EFM32ZG Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Silicon Labs</keyword>
    <keyword>EFM32ZG</keyword>
    <keyword>EFM32</keyword>
    <keyword>Gecko</keyword>
  </keywords>

  <devices>

    <family Dfamily="EFM32ZG Series" Dvendor="Silicon Labs:21">
      <processor Dcore="Cortex-M0+" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
      <processor Dclock="24000000"/>

      <book name="Documents\dui0662a_cortex_m0p_r0p0_dgug.pdf" title="Cortex-M0+ Generic User Guide"/>
      <book name="Documents\EFM32ZG-RM.pdf"                    title="EFM32ZG Series Reference Manual"/>
      <description>
The EFM32 Zero Gecko is the latest addition to the Silicon Labs' Gecko portfolio of ultra low power and energy friendly 32-bit microcontrollers (MCUs).
With a unique combination of the powerful ARM Cortex-M0+ core, innovative low energy techniques, short wake-up time from energy saving modes and a wide selection of peripherals, the Zero Gecko is ideal for battery operated applications and other systems requiring high performance and low-energy consumption.
      </description>

      <feature type="Timer"         n="2"                           name="16-bit Timer/Counter"/>
      <feature type="AnalogOther"   n="1"                           name="Analog Comparator"/>
      <feature type="Other"         n="1"                           name="Capacitive sensing with up to 16 inputs"/>
      <feature type="I2C"           n="1"/>
      <feature type="USART"         n="1"/>


      <!-- ************************  Subfamily 'EFM32ZG108'  **************************** -->
      <subFamily DsubFamily="EFM32ZG108">
        <feature type="IOs"           n="17"                          name="General Purpose I/O pins"/>
      
        <!-- *************************  Device 'EFM32ZG108F16'  ***************************** -->
        <device Dname="EFM32ZG108F16">
          <compile header="Device\EFM32ZG\Include\em_device.h" define="EFM32ZG108F16"/>
          <debug svd="SVD\EFM32ZG\EFM32ZG108F16.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash\EFM32ZG.FLM" start="0x00000000" size="0x00004000"             default="1"/>

          <book name="Documents\EFM32ZG108.pdf" title="EFM32ZG108 Data Sheet"/>
        </device>
        
        <!-- *************************  Device 'EFM32ZG108F32'  ***************************** -->
        <device Dname="EFM32ZG108F32">
          <compile header="Device\EFM32ZG\Include\em_device.h" define="EFM32ZG108F32"/>
          <debug svd="SVD\EFM32ZG\EFM32ZG108F32.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash\EFM32ZG.FLM" start="0x00000000" size="0x00008000"             default="1"/>

          <book name="Documents\EFM32ZG108.pdf" title="EFM32ZG108 Data Sheet"/>
        </device>
        
        <!-- *************************  Device 'EFM32ZG108F4'  ***************************** -->
        <device Dname="EFM32ZG108F4">
          <compile header="Device\EFM32ZG\Include\em_device.h" define="EFM32ZG108F4"/>
          <debug svd="SVD\EFM32ZG\EFM32ZG108F4.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00001000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash\EFM32ZG.FLM" start="0x00000000" size="0x00001000"             default="1"/>

          <book name="Documents\EFM32ZG108.pdf" title="EFM32ZG108 Data Sheet"/>
        </device>
        
        <!-- *************************  Device 'EFM32ZG108F8'  ***************************** -->
        <device Dname="EFM32ZG108F8">
          <compile header="Device\EFM32ZG\Include\em_device.h" define="EFM32ZG108F8"/>
          <debug svd="SVD\EFM32ZG\EFM32ZG108F8.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash\EFM32ZG.FLM" start="0x00000000" size="0x00002000"             default="1"/>

          <book name="Documents\EFM32ZG108.pdf" title="EFM32ZG108 Data Sheet"/>
        </device>
      </subFamily>
  
      <!-- ************************  Subfamily 'EFM32ZG110'  **************************** -->
      <subFamily DsubFamily="EFM32ZG110">
        <feature type="IOs"           n="17"                          name="General Purpose I/O pins"/>
        <feature type="ADC"           n="1"       m="12"              name="12-bit 1 Msamples/s Analog to Digital Converter"/>
        <feature type="Crypto"        n="1"                           name="Hardware AES with 128/256-bit keys in 54/75 cycles"/>
      
        <!-- *************************  Device 'EFM32ZG110F16'  ***************************** -->
        <device Dname="EFM32ZG110F16">
          <compile header="Device\EFM32ZG\Include\em_device.h" define="EFM32ZG110F16"/>
          <debug svd="SVD\EFM32ZG\EFM32ZG110F16.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash\EFM32ZG.FLM" start="0x00000000" size="0x00004000"             default="1"/>

          <book name="Documents\EFM32ZG110.pdf" title="EFM32ZG110 Data Sheet"/>
        </device>
        
        <!-- *************************  Device 'EFM32ZG110F32'  ***************************** -->
        <device Dname="EFM32ZG110F32">
          <compile header="Device\EFM32ZG\Include\em_device.h" define="EFM32ZG110F32"/>
          <debug svd="SVD\EFM32ZG\EFM32ZG110F32.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash\EFM32ZG.FLM" start="0x00000000" size="0x00008000"             default="1"/>

          <book name="Documents\EFM32ZG110.pdf" title="EFM32ZG110 Data Sheet"/>
        </device>
        
        <!-- *************************  Device 'EFM32ZG110F4'  ***************************** -->
        <device Dname="EFM32ZG110F4">
          <compile header="Device\EFM32ZG\Include\em_device.h" define="EFM32ZG110F4"/>
          <debug svd="SVD\EFM32ZG\EFM32ZG110F4.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00001000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash\EFM32ZG.FLM" start="0x00000000" size="0x00001000"             default="1"/>

          <book name="Documents\EFM32ZG110.pdf" title="EFM32ZG110 Data Sheet"/>
        </device>
        
        <!-- *************************  Device 'EFM32ZG110F8'  ***************************** -->
        <device Dname="EFM32ZG110F8">
          <compile header="Device\EFM32ZG\Include\em_device.h" define="EFM32ZG110F8"/>
          <debug svd="SVD\EFM32ZG\EFM32ZG110F8.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash\EFM32ZG.FLM" start="0x00000000" size="0x00002000"             default="1"/>

          <book name="Documents\EFM32ZG110.pdf" title="EFM32ZG110 Data Sheet"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32ZG210'  **************************** -->
      <subFamily DsubFamily="EFM32ZG210">
        <feature type="IOs"           n="24"                          name="General Purpose I/O pins"/>
        <feature type="ADC"           n="1"       m="12"              name="12-bit 1 Msamples/s Analog to Digital Converter"/>
        <feature type="Crypto"        n="1"                           name="Hardware AES with 128/256-bit keys in 54/75 cycles"/>
      
        <!-- *************************  Device 'EFM32ZG210F16'  ***************************** -->
        <device Dname="EFM32ZG210F16">
          <compile header="Device\EFM32ZG\Include\em_device.h" define="EFM32ZG210F16"/>
          <debug svd="SVD\EFM32ZG\EFM32ZG210F16.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash\EFM32ZG.FLM" start="0x00000000" size="0x00004000"             default="1"/>

          <book name="Documents\EFM32ZG210.pdf" title="EFM32ZG210 Data Sheet"/>
        </device>
        
        <!-- *************************  Device 'EFM32ZG210F32'  ***************************** -->
        <device Dname="EFM32ZG210F32">
          <compile header="Device\EFM32ZG\Include\em_device.h" define="EFM32ZG210F32"/>
          <debug svd="SVD\EFM32ZG\EFM32ZG210F32.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash\EFM32ZG.FLM" start="0x00000000" size="0x00008000"             default="1"/>

          <book name="Documents\EFM32ZG210.pdf" title="EFM32ZG210 Data Sheet"/>
        </device>
        
