jack77er/openUTRUSTA/Packages/.cache/Keil.EFM32ZGxxx_DFP.1.1.0.pdsc
        <!-- *************************  Device 'EFM32ZG210F4'  ***************************** -->
        <device Dname="EFM32ZG210F4">
          <compile header="Device\EFM32ZG\Include\em_device.h" define="EFM32ZG210F4"/>
          <debug svd="SVD\EFM32ZG\EFM32ZG210F4.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00001000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash\EFM32ZG.FLM" start="0x00000000" size="0x00001000"             default="1"/>

          <book name="Documents\EFM32ZG210.pdf" title="EFM32ZG210 Data Sheet"/>
        </device>
        
        <!-- *************************  Device 'EFM32ZG210F8'  ***************************** -->
        <device Dname="EFM32ZG210F8">
          <compile header="Device\EFM32ZG\Include\em_device.h" define="EFM32ZG210F8"/>
          <debug svd="SVD\EFM32ZG\EFM32ZG210F8.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash\EFM32ZG.FLM" start="0x00000000" size="0x00002000"             default="1"/>

          <book name="Documents\EFM32ZG210.pdf" title="EFM32ZG210 Data Sheet"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32ZG222'  **************************** -->
      <subFamily DsubFamily="EFM32ZG222">
        <feature type="IOs"           n="37"                          name="General Purpose I/O pins"/>
        <feature type="ADC"           n="1"       m="12"              name="12-bit 1 Msamples/s Analog to Digital Converter"/>
        <feature type="Crypto"        n="1"                           name="Hardware AES with 128/256-bit keys in 54/75 cycles"/>
      
        <!-- *************************  Device 'EFM32ZG222F16'  ***************************** -->
        <device Dname="EFM32ZG222F16">
          <compile header="Device\EFM32ZG\Include\em_device.h" define="EFM32ZG222F16"/>
          <debug svd="SVD\EFM32ZG\EFM32ZG222F16.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash\EFM32ZG.FLM" start="0x00000000" size="0x00004000"             default="1"/>

          <book name="Documents\EFM32ZG222.pdf" title="EFM32ZG222 Data Sheet"/>
        </device>
        
        <!-- *************************  Device 'EFM32ZG222F32'  ***************************** -->
        <device Dname="EFM32ZG222F32">
          <compile header="Device\EFM32ZG\Include\em_device.h" define="EFM32ZG222F32"/>
          <debug svd="SVD\EFM32ZG\EFM32ZG222F32.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash\EFM32ZG.FLM" start="0x00000000" size="0x00008000"             default="1"/>

          <book name="Documents\EFM32ZG222.pdf" title="EFM32ZG222 Data Sheet"/>
        </device>
        
        <!-- *************************  Device 'EFM32ZG222F4'  ***************************** -->
        <device Dname="EFM32ZG222F4">
          <compile header="Device\EFM32ZG\Include\em_device.h" define="EFM32ZG222F4"/>
          <debug svd="SVD\EFM32ZG\EFM32ZG222F4.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00001000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash\EFM32ZG.FLM" start="0x00000000" size="0x00001000"             default="1"/>

          <book name="Documents\EFM32ZG222.pdf" title="EFM32ZG222 Data Sheet"/>
        </device>
        
        <!-- *************************  Device 'EFM32ZG222F8'  ***************************** -->
        <device Dname="EFM32ZG222F8">
          <compile header="Device\EFM32ZG\Include\em_device.h" define="EFM32ZG222F8"/>
          <debug svd="SVD\EFM32ZG\EFM32ZG222F8.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash\EFM32ZG.FLM" start="0x00000000" size="0x00002000"             default="1"/>

          <book name="Documents\EFM32ZG222.pdf" title="EFM32ZG222 Data Sheet"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="Compiler GCC">
      <require Tcompiler="GCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="EFM32ZG">
      <description>Silicon Labs EFM32ZG device series</description>
      <require Dvendor="Silicon Labs:21" Dname="EFM32ZG*"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="EFM32ZG CMSIS">
      <description>Silicon Labs EFM32ZG device series and CMSIS Core</description>
      <require condition="EFM32ZG"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <!-- emlib Conditions -->
    <condition id="emlib Framework">
      <description>Silicon Labs emlib Framework</description>
      <require condition="EFM32ZG"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
    </condition>
    <condition id="emlib SYSTEM">
      <description>Silicon Labs emlib with SYSTEM</description>
      <require condition="EFM32ZG"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="SYSTEM"/>
    </condition>
