jack77er/openUTRUSTA/Packages/.cache/Keil.EFM32ZGxxx_DFP.1.1.0.pdsc
    <component Cclass="Device" Cgroup="emlib" Csub="SYSTEM"  Cversion="4.0.0" condition="emlib Framework">
      <description>System Peripheral </description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_SYSTEM
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emlib\doc\html\group__SYSTEM.html"/>
        <file category="header"  name="emlib\inc\em_system.h"/>
        <file category="source"  name="emlib\src\em_system.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emlib" Csub="TIMER"   Cversion="4.0.0" condition="emlib Framework">
      <description>Timer/Counter (TIMER) Peripheral</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_TIMER
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emlib\doc\html\group__TIMER.html"/>
        <file category="header"  name="emlib\inc\em_timer.h"/>
        <file category="source"  name="emlib\src\em_timer.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emlib" Csub="USART"   Cversion="4.0.0" condition="emlib CMU">
      <description>Universal Synchronous/Asynchronous Receiver/Transmitter (USART) Peripheral</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_USART
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emlib\doc\html\group__USART.html"/>
        <file category="header"  name="emlib\inc\em_usart.h"/>
        <file category="source"  name="emlib\src\em_usart.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emlib" Csub="VCMP"    Cversion="4.0.0" condition="emlib Framework">
      <description>Voltage Comparator (VCMP) Peripheral</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_VCMP
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emlib\doc\html\group__VCMP.html"/>
        <file category="header"  name="emlib\inc\em_vcmp.h"/>
        <file category="source"  name="emlib\src\em_vcmp.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emlib" Csub="WDOG"    Cversion="4.0.0" condition="emlib Framework">
      <description>Watchdog (WDOG) Peripheral</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_WDOG
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emlib\doc\html\group__WDOG.html"/>
        <file category="header"  name="emlib\inc\em_wdog.h"/>
        <file category="source"  name="emlib\src\em_wdog.c"/>
      </files>
    </component>

    <!-- emdrv EFM32ZG -->
<!-- emdrv Component not added
    <component Cclass="Device" Cgroup="emdrv" Csub="DMADRV" Cversion="4.0.0" condition="emdrv DMADRV">
      <description>Direct Memory Access Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMDRV_DMADRV
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emdrv\emdrvdoc\html\group__DMADRV.html"/>
        <file category="include" name="emdrv\common\inc\"/>
        <file category="header"  name="emdrv\config\dmadrv_config.h" attr="config" version="4.0.0"/>
        <file category="header"  name="emdrv\dmadrv\inc\dmadrv.h"/>
        <file category="source"  name="emdrv\dmadrv\src\dmadrv.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emdrv" Csub="GPIOINT" Cversion="4.0.0" condition="emdrv GPIOINT">
      <description>General Purpose Input/Output Interrupt dispatcher</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMDRV_GPIOINT
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emdrv\emdrvdoc\html\group__GPIOINT.html"/>
        <file category="include" name="emdrv\common\inc\"/>
        <file category="header"  name="emdrv\gpiointerrupt\inc\gpiointerrupt.h"/>
        <file category="source"  name="emdrv\gpiointerrupt\src\gpiointerrupt.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emdrv" Csub="NVM" Cversion="4.0.0" condition="emdrv NVM">
      <description>Non-volatile Memory Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMDRV_NVM
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emdrv\emdrvdoc\html\group__NVM.html"/>
        <file category="include" name="emdrv\common\inc\"/>
        <file category="header"  name="emdrv\config\nvm_config.h" attr="config" version="4.0.0"/>
        <file category="source"  name="emdrv\config\nvm_config.c"/>
        <file category="header"  name="emdrv\nvm\inc\nvm.h"/>
        <file category="source"  name="emdrv\nvm\src\nvm.c"/>
        <file category="source"  name="emdrv\nvm\src\nvm_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emdrv" Csub="RTCDRV" Cversion="4.0.0" condition="emdrv RTCDRV">
      <description>Real Time Clock Timer Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMDRV_RTCDRV
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emdrv\emdrvdoc\html\group__RTCDRV.html"/>
        <file category="include" name="emdrv\common\inc\"/>
        <file category="header"  name="emdrv\config\rtcdrv_config.h" attr="config" version="4.0.0"/>
        <file category="header"  name="emdrv\rtcdrv\inc\rtcdriver.h"/>
        <file category="source"  name="emdrv\rtcdrv\src\rtcdriver.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emdrv" Csub="SLEEP" Cversion="4.0.0" condition="emdrv SLEEP">
      <description>Sleep Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMDRV_SLEEP
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emdrv\emdrvdoc\html\group__SLEEP.html"/>
        <file category="include" name="emdrv\common\inc\"/>
        <file category="header"  name="emdrv\sleep\inc\sleep.h"/>
        <file category="source"  name="emdrv\sleep\src\sleep.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emdrv" Csub="SPIDRV" Cversion="4.0.0" condition="emdrv SPIDRV">
      <description>Serial Peripheral Interface Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMDRV_SPIDRV
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emdrv\emdrvdoc\html\group__SPIDRV.html"/>
        <file category="include" name="emdrv\common\inc\"/>
        <file category="header"  name="emdrv\config\spidrv_config.h" attr="config" version="4.0.0"/>
        <file category="header"  name="emdrv\spidrv\inc\spidrv.h"/>
        <file category="source"  name="emdrv\spidrv\src\spidrv.c"/>
      </files>
    </component>
